//
//  FruitData.swift
//  Fructus
//
//  Created by sasan on 6/28/22.
//

import SwiftUI

//MARK: - FRUITS DATA

let fruitsData: [Fruit]=[
    Fruit(
        title: "زغال‌اخته‌آبی",
        headline: "زغال‌اخته‌آبی(بلوبری) میوه ای شیرین، مغذی و بسیار محبوب در سراسر جهان است.",
        image: "blueberry",
        gradientColors: [Color("ColorBlueberryLight"), Color("ColorBlueberryDark")],
        description: """
          زغال اخته گیاهان گلدار چند ساله با توت های آبی یا بنفش هستند. آنها در بخش سیانوکوکوس در جنس Vaccinium طبقه بندی می شوند. واکسینیم همچنین شامل زغال اخته، زغال اخته، هاکلبری و بلوبری مادیرا است.

                    زغال اخته های تجاری - هم وحشی (کم بوته) و هم کشت شده (پر بوته) - همگی بومی آمریکای شمالی هستند. واریته های بوته بوش در طول دهه 1930 به اروپا معرفی شدند.

                    زغال اخته معمولاً درختچه های سجده ای هستند که می توانند از نظر ارتفاع از 10 سانتی متر (3.9 اینچ) تا 4 متر (13 فوت) متفاوت باشند. در تولید تجاری زغال اخته، گونه هایی با توت های کوچک و به اندازه نخودی که روی بوته های سطح پایین رشد می کنند، به عنوان "زغال اخته کم بوته" (مترادف با "وحشی") شناخته می شوند، در حالی که گونه هایی با توت های بزرگتر که روی بوته های بلندتر رشد می کنند، به عنوان شناخته می شوند. "زغال اخته بوته ای".

                    کانادا بزرگترین تولید کننده زغال اخته کم بوته است، در حالی که ایالات متحده حدود 40 درصد از عرضه جهانی بلوبری را تولید می کند.

          
                    موارد استفاده
          
                    زغال اخته ها به صورت تازه فروخته می شوند یا به صورت میوه، پوره، آب میوه یا توت خشک یا دم کرده به صورت جداگانه فرآوری می شوند. پس از آن ممکن است در انواع کالاهای مصرفی مانند ژله، مربا، پای زغال اخته، کلوچه، غذاهای میان وعده یا به عنوان افزودنی به غلات صبحانه استفاده شود.

                    مربای زغال اخته از زغال اخته، شکر، آب و پکتین میوه تهیه می شود. سس بلوبری یک سس شیرین است که با استفاده از زغال اخته به عنوان ماده اولیه تهیه می شود.

                    شراب زغال اخته از گوشت و پوست توت تهیه می شود که تخمیر شده و سپس بالغ می شود. معمولا از گونه های کم بوته استفاده می شود.

                    مواد مغذی

                    بلوبری شامل 14 درصد کربوهیدرات، 0.7 درصد پروتئین، 0.3 درصد چربی و 84 درصد آب است (جدول). آنها فقط حاوی مقادیر ناچیزی از ریزمغذی ها، با سطوح متوسط ​​(نسبت به مقادیر روزانه مربوطه) (DV) از مواد معدنی ضروری رژیم غذایی منگنز، ویتامین C، ویتامین K و فیبر غذایی (جدول) هستند.

                    به طور کلی، محتوای مواد مغذی زغال اخته درصد پایینی از DV (جدول) است. یک وعده مقدار کالری نسبتاً کم 57 کیلوکالری با بار گلیسمی 6 فراهم می کند.
          """,
        nutrition: ["240 kJ (57 kcal)","9.96 g","0.33 g","0.74 g","A, B1, B2, B3, B5, B6, B9, C, E, K","کلسیم, آهن, منیزیم, منگنز, فسفر, سدیم, روی"]
      ),
      Fruit(
        title: "توت فرنگی",
        headline: "به دلیل عطر مشخص، رنگ قرمز، بافت آبدار و شیرینی آن بسیار مورد استقبال قرار گرفته است.",
        image: "strawberry",
        gradientColors: [Color("ColorStrawberryLight"), Color("ColorStrawberryDark")],
        description: """
          توت فرنگی باغی (یا به سادگی توت فرنگی؛ Fragaria × ananassa) یک گونه هیبریدی از جنس Fragaria است که در مجموع به عنوان توت فرنگی شناخته می شود که در سراسر جهان برای میوه های خود کشت می شود. این میوه به دلیل عطر خاص، رنگ قرمز روشن، بافت آبدار و شیرینی آن به طور گسترده مورد استقبال قرار می گیرد. به مقدار زیاد، چه تازه و چه در غذاهای آماده مانند مربا، آب میوه، پای، بستنی، میلک شیک و شکلات مصرف می شود. طعم دهنده ها و رایحه های مصنوعی توت فرنگی نیز به طور گسترده در محصولاتی مانند آب نبات، صابون، براق کننده لب، عطر و بسیاری دیگر استفاده می شود.

                    توت فرنگی، از نقطه نظر گیاه شناسی، توت نیست. از نظر فنی، این یک میوه فرعی است، به این معنی که قسمت گوشتی آن نه از تخمدان های گیاه، بلکه از ظرفی که تخمدان ها را نگه می دارد، به دست می آید.[4] هر "دانه" ظاهری (آچین) در قسمت بیرونی میوه در واقع یکی از تخمدان های گل است که یک دانه در داخل آن قرار دارد.

                    آشپزی

                    علاوه بر مصرف تازه، توت فرنگی را می توان منجمد کرد یا به صورت مربا یا کنسرو درست کرد، [45] و همچنین خشک کرد و در غذاهای آماده مانند میله غلات استفاده کرد. توت فرنگی و طعم دهنده های توت فرنگی یک افزودنی محبوب برای محصولات لبنی مانند شیر توت فرنگی، بستنی توت فرنگی، میلک شیک/اسموتی توت فرنگی و ماست توت فرنگی هستند.

                    در بریتانیا، "توت فرنگی و خامه" یک دسر محبوب است که در مسابقات تنیس ویمبلدون مصرف می شود. توت فرنگی و خامه نیز یک میان وعده اصلی در مکزیک است که معمولاً در بستنی فروشی ها موجود است. در سوئد، توت فرنگی یک دسر سنتی است که در روز سنت جان سرو می شود که به عنوان شب نیمه تابستان نیز شناخته می شود. بسته به منطقه، پای توت فرنگی، پای ریواس توت فرنگی یا کیک کوتاه توت فرنگی نیز رایج است. در یونان، توت فرنگی را می توان با شکر پاشید و سپس در Metaxa، یک براندی، فرو برد و به عنوان دسر سرو کرد. در ایتالیا، توت فرنگی برای دسرهای مختلف و به عنوان طعم دهنده رایج برای ژلاتو (gelato alla fragola) استفاده می شود.

                    Suonenjoki در شمال ساوونیای فنلاند شهر کوچکی به دلیل توت فرنگی هایش است، به همین دلیل به "شهر توت فرنگی" یا "پایتخت توت فرنگی" نیز معروف است. بسیاری از افراد خارجی، عمدتاً از اوکراین و روسیه، در تابستان به Suonenjoki می آیند تا در مزارع توت فرنگی کار کنند. این باعث می شود Suonenjoki بین المللی ترین شهر فنلاند در تابستان باشد. یک مهمانی در Suonenjoki در ماه ژوئیه به نام Mansikkakarnevaalit، "کارناوال توت فرنگی" برگزار می شود.

                    تغذیه

                    یک وعده (100 گرم؛ جدول را ببینید) توت فرنگی حاوی تقریباً 33 کیلو کالری است، منبع عالی ویتامین C، منبع خوبی از منگنز است و چندین ویتامین دیگر و مواد معدنی غذایی را در مقادیر کمتر فراهم می کند.

                    توت فرنگی حاوی مقدار کمی اسیدهای چرب غیراشباع ضروری در روغن آکن (دانه) است.
          """,
        nutrition: ["136 kJ (33 kcal)","4.89 g","0.3 g","0.67 g","B1, B2, B3, B5, B6, B9, Choline, C, E, K","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "لیمو",
        headline: "شکی نیست که لیموها خوشمزه هستند، اما آیا اضافه کردن آن به آب شما را سالم تر می کند؟",
        image: "lemon",
        gradientColors: [Color("ColorLemonLight"), Color("ColorLemonDark")],
        description: """
          لیمو، Citrus limon، گونه‌ای از درختان کوچک همیشه سبز از خانواده گیاهان گلدار Rutaceae، بومی جنوب آسیا، عمدتاً شمال شرق هند است. میوه های آن گرد شکل است.

                    میوه زرد رنگ بیضی شکل این درخت برای مقاصد آشپزی و غیر آشپزی در سراسر جهان استفاده می شود، در درجه اول برای آب آن، که هم مصارف آشپزی و هم برای تمیز کردن دارد. از خمیر و پوست آن در پخت و پز و پخت نیز استفاده می شود. آب لیمو حدود 5 تا 6 درصد اسید سیتریک است که pH آن حدود 2.2 است که طعم ترش به آن می دهد. طعم ترش متمایز آب لیمو آن را به یک عنصر کلیدی در نوشیدنی ها و غذاهایی مانند لیموناد و پای مرنگ لیمو تبدیل می کند.

                    تغذیه

                    لیمو یک منبع غنی از ویتامین C است که 64 درصد از ارزش روزانه را در 100 گرم مقدار مرجع تامین می کند (جدول). سایر مواد مغذی ضروری محتوای کمی دارند.

                    لیمو حاوی مواد شیمیایی گیاهی متعددی از جمله پلی فنول ها، ترپن ها و تانن ها است.[14] آب لیمو حاوی اسید سیتریک کمی بیشتر از آب لیمو (حدود 47 گرم در لیتر)، تقریباً دو برابر اسید سیتریک آب گریپ فروت و حدود پنج برابر مقدار اسید سیتریک موجود در آب پرتقال است.

                    آشپزی
                    
                    آب، پوست و پوست لیمو در انواع غذاها و نوشیدنی ها استفاده می شود. از لیمو کامل برای تهیه مارمالاد، کشک لیمو و لیکور لیمو استفاده می شود. برش های لیمو و پوست لیمو به عنوان چاشنی غذا و نوشیدنی استفاده می شود. پوست لیمو، پوست بیرونی رنده شده میوه، برای طعم دادن به محصولات پخته شده، پودینگ، برنج و سایر غذاها استفاده می شود.

                    آب میوه

                    از آب لیمو برای تهیه لیموناد، نوشابه و کوکتل استفاده می شود. از آن در مارینادهای ماهی استفاده می شود، جایی که اسید آن آمین های موجود در ماهی را با تبدیل آنها به نمک های آمونیوم غیرفرار خنثی می کند. در گوشت، اسید تا حدی فیبرهای کلاژن سخت را هیدرولیز می کند و آن را نرم می کند.[18] در بریتانیا، آب لیمو به طور مکرر به پنکیک اضافه می شود، به خصوص در روز سه شنبه.

                    آب لیمو همچنین به عنوان یک نگهدارنده کوتاه مدت در برخی از مواد غذایی که تمایل به اکسید شدن و قهوه ای شدن پس از برش دادن دارند (قهوه ای شدن آنزیمی) مانند سیب، موز و آووکادو استفاده می شود، جایی که اسید آن باعث دناتوره شدن آنزیم ها می شود.

                    پوست کندن

                    در مراکش، لیمو را در شیشه ها یا بشکه های نمک نگهداری می کنند. نمک در پوست و پوست نفوذ می کند و آنها را نرم می کند و آنها را درمان می کند تا تقریباً نامحدود باقی بمانند.[19] لیمو ترش در انواع غذاها استفاده می شود. لیموهای نگهداری شده را می توان در غذاهای سیسیلی، ایتالیایی، یونانی و فرانسوی نیز یافت.

                    پوست را می توان در ساخت پکتین، پلی ساکارید مورد استفاده به عنوان عامل ژل کننده و تثبیت کننده در مواد غذایی و سایر محصولات استفاده کرد.[20]

                    نفت

                    روغن لیمو از سلول های حاوی روغن در پوست استخراج می شود. یک دستگاه سلول ها را می شکند و از اسپری آب برای شستشوی روغن استفاده می کند. سپس مخلوط روغن/آب فیلتر شده و با سانتریفیوژ جدا می شود.[21]

                    برگها

                    از برگ های درخت لیمو برای تهیه چای و تهیه گوشت های پخته و غذاهای دریایی استفاده می شود.
          """,
        nutrition: ["121 kJ (29 kcal)","2.5 g","0.3 g","1.1 g","B1, B2, B3, B5, B6, B9, C, Choline","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, روی"]
      ),
      Fruit(
        title: "آلو",
        headline: "آلو یک میوه بسیار مغذی است. منبع عالی ویتامین ها، مواد معدنی، فیبر و آنتی اکسیدان ها است.",
        image: "plum",
        gradientColors: [Color("ColorPlumLight"), Color("ColorPlumDark")],
        description: """
          آلو میوه ای از زیرجنس Prunus از تیره Prunus است. این زیرجنس از سایر زیرجنس‌ها (هلو، گیلاس، گیلاس پرنده و غیره) در شاخه‌های دارای جوانه انتهایی و جوانه‌های جانبی منفرد (غیر خوشه‌ای)، گل‌ها در گروه‌های یک تا پنج تایی با هم روی ساقه‌های کوتاه و میوه دارای جوانه‌های انتهایی متمایز می‌شود. یک شیار از یک طرف و یک سنگ صاف (یا گودال).

                    میوه آلو بالغ ممکن است دارای یک پوشش مومی سفید غبارآلود باشد که به آنها ظاهری آبکی می دهد. این یک پوشش مومی اپیکوتیکولی است و به "شکوفه موم" معروف است. میوه‌های آلو خشک «آلو خشک» یا آلو خشک نامیده می‌شوند، اگرچه در بسیاری از کشورها، آلو یک نوع مشخص از آلو خشک است که ظاهری چروکیده دارد (مثلاً Li hing mui).

                    شرح

                    آلوها گروه متنوعی از گونه ها هستند. درختان آلو که از نظر تجاری مهم هستند اندازه متوسط ​​هستند و معمولاً تا ارتفاع 5 تا 6 متر هرس می شوند. این درخت دارای سختی متوسط ​​است. بدون هرس، ارتفاع درختان به 12 متر می رسد و در طول 10 متر پخش می شود. آنها در ماه های مختلف در نقاط مختلف جهان شکوفا می شوند. به عنوان مثال، در حدود ژانویه در تایوان و اوایل آوریل در بریتانیا.

                    میوه ها معمولاً اندازه متوسط، بین 2 تا 7 سانتی متر قطر، کروی تا بیضی دارند. گوشت آن سفت و آبدار است. پوست میوه صاف و دارای سطح مومی طبیعی است که به گوشت می‌چسبد. آلو یک دروپه است، به این معنی که میوه گوشتی آن یک دانه سخت را احاطه کرده است.

                    کشت

                    هنگامی که در اوایل بهار گل می دهد، درخت آلو پر از شکوفه می شود و در سال خوب تقریباً 50 درصد گل ها گرده افشانی شده و به آلو تبدیل می شوند. گلدهی پس از 80 درجه روز رشد شروع می شود.

                    اگر هوا خیلی خشک باشد، آلوها از مرحله خاصی نگذشته اند، اما در حالی که جوانه های ریز و سبز باقی مانده اند، از درخت می افتند، و اگر به طور نامناسب مرطوب باشد یا اگر آلوها به محض رسیدن برداشت نشوند. میوه ممکن است یک بیماری قارچی به نام پوسیدگی قهوه ای ایجاد کند. پوسیدگی قهوه ای سمی نیست و برخی از نواحی آسیب دیده را می توان از میوه جدا کرد، اما مگر اینکه پوسیدگی فوراً گرفتار شود، میوه دیگر خوراکی نخواهد بود. آلو به عنوان گیاه غذایی توسط لارو برخی از Lepidoptera از جمله پروانه آبان، بید زیبا و پروانه خرقه کوتاه استفاده می شود.

                    طعم میوه آلو از شیرین تا ترش متغیر است. خود پوست ممکن است به خصوص ترش باشد. آبدار است و می توان آن را به صورت تازه مصرف کرد یا در مرباسازی یا سایر دستور پخت ها استفاده کرد. آب آلو را می توان به شراب آلو تخمیر کرد. در مرکز انگلستان، یک نوشیدنی الکلی سیب‌زمینی معروف به آلو جرکوم از آلو درست می‌شود. آلو خشک و شور به عنوان میان وعده استفاده می شود که گاهی اوقات به نام سالادیتو یا سالائو نیز شناخته می شود.

                    طعم‌های مختلفی از آلو خشک در خواربارفروشی‌های چینی و فروشگاه‌های تخصصی در سراسر جهان موجود است. آنها معمولاً خشک تر از آلو معمولی هستند. خامه، جینسینگ، تند و شور از جمله انواع رایج آن هستند. شیرین بیان به طور کلی برای تشدید طعم این آلوها استفاده می شود و برای تهیه نوشیدنی های نمکی آلو و تاپینگ هایی برای یخ تراشیده شده یا بائوبینگ استفاده می شود. ترشی آلو نوع دیگری از کنسرو موجود در آسیا و فروشگاه های تخصصی بین المللی است.

                    نوع ژاپنی، به نام umeboshi، اغلب برای توپ های برنج، به نام onigiri یا omusubi استفاده می شود. امه که از آن امبوشی درست می شود، بیشتر به زردآلو مرتبط است تا آلو. در بالکان، آلو به یک نوشیدنی الکلی به نام اسلیوویتز (براندی آلو) تبدیل می شود (به صربی: šljivovica).

                    تعداد زیادی آلو از نوع دامسون نیز در مجارستان کشت می‌شود، جایی که به آنها szilva می‌گویند و برای تهیه لک‌وار (مربای خمیر آلو)، پالینکا (براندی میوه‌ای سنتی)، کوفته‌های آلو و سایر غذاها استفاده می‌شود. در رومانی، 80 درصد از تولید آلو برای تولید براندی مشابه به نام țuică استفاده می شود.
          """,
        nutrition: ["192 kJ (46 kcal)","9.92 g","0.28 g","0.7 g","A, B1, B2, B3, B5, B6, B9, C, E, K","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "لیمو سبز",
        headline: "مرکبات ترش، گرد و سبز روشن. لیموترش سرشار از ویتامین C، آنتی اکسیدان ها و سایر مواد مغذی است.",
        image: "lime",
        gradientColors: [Color("ColorLimeLight"), Color("ColorLimeDark")],
        description: """
        لیمو سبز[1] یک میوه مرکبات است که معمولاً گرد، به رنگ سبز، به قطر 3-6 سانتی متر (1.2-2.4 اینچ) است. حاوی وزیکول های اسیدی آبمیوه است.

               گونه‌های مختلفی از درختان مرکبات وجود دارد که میوه‌های آن‌ها آهک نامیده می‌شود، از جمله آهک کلیدی (Citrus aurantiifolia)، آهک ایرانی، آهک کافیر و آهک بیابانی. لیموترش منبعی غنی از ویتامین C است، ترش است و اغلب برای تقویت طعم غذاها و نوشیدنی ها استفاده می شود. آنها در تمام طول سال رشد می کنند.[3] گیاهان با میوه به نام "آهک" منشاء ژنتیکی متنوعی دارند. آهک ها یک گروه مونوفیلتیک تشکیل نمی دهند.

               کشت

               لیموترش نسبت به لیمو دارای مقادیر بیشتری قند و اسید است.[2] آب لیموترش ممکن است از لیموترش تازه گرفته شود، یا در بطری ها در هر دو نوع شیرین نشده و شیرین خریداری شود. آب لیموترش برای تهیه لیموترش و به عنوان یک ماده (معمولاً به عنوان مخلوط ترش) در بسیاری از کوکتل ها استفاده می شود.

               ترشی لیمو جزء جدایی ناپذیر غذاهای هندی است. غذاهای هندی جنوبی به شدت بر پایه لیموترش است. داشتن ترشی لیمو یا ترشی لیمو از ضروریات Onam Sadhya محسوب می شود.

               در آشپزی، لیموترش هم به خاطر اسیدی بودن آب و هم از نظر عطر گلی مزه آن ارزش دارد. این یک عنصر رایج در غذاهای اصیل مکزیکی، ویتنامی و تایلندی است. سوپ لیمو یک غذای سنتی از ایالت یوکاتان مکزیک است. همچنین به دلیل خاصیت ترشی آن در سرویچه استفاده می شود. برخی از دستور العمل های گواکامول به آب لیمو نیاز دارند.

               استفاده از لیموهای خشک (به نام لیمو سیاه یا لومی) به عنوان طعم دهنده در غذاهای ایرانی و عراقی و همچنین در بهارات به سبک خلیج فارس (مخلوط ادویه که کبسا یا کبسا نیز نامیده می شود) معمول است.

               لیموترش یکی از مواد تشکیل دهنده بسیاری از غذاهای هندی است و انواع زیادی از ترشی ها تهیه می شود، به عنوان مثال. ترشی لیمو شیرین، ترشی شور و چاتنی لیمو ترشی.

               آهک کلیدی به دسر آمریکایی معروف به کیک آهک طعم دهنده شخصیت می دهد. در استرالیا از آهک صحرایی برای تهیه مارمالاد استفاده می شود.

               آهک یکی از مواد تشکیل دهنده چندین کوکتل هایبال است که اغلب بر پایه جین هستند، مانند جین و تونیک، گیملت و ریکی. آب لیمو ترش تازه نیز یک عنصر کلیدی در مارگاریتا در نظر گرفته می شود، اگرچه گاهی اوقات آب لیمو جایگزین می شود. همچنین با بسیاری از کوکتل های رم مانند Daiquiri و نوشیدنی های استوایی - به ویژه در فرهنگ Tiki - ارتباط نزدیکی دارد.

               عصاره آهک و اسانس آهک اغلب در عطرها، محصولات پاک کننده و رایحه درمانی استفاده می شود.
        """,
        nutrition: ["126 kJ (30 kcal)","1.7 g","0.2 g","0.7 g","B1, B2, B3, B5, B6, B9, C","کلسیم, آهن, منیزیم, فسفر, پتاسیم, سدیم"]
      ),
      Fruit(
        title: "انار",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "pomegranate",
        gradientColors: [Color("ColorPomegranateLight"), Color("ColorPomegranateDark")],
        description: """
          انار (Punica granatum) یک درختچه برگ‌ریز میوه‌دار از خانواده Lythraceae، زیر خانواده Punicoideae است که ارتفاع آن بین 5 تا 10 متر (16 و 33 فوت) است.

                    منشأ انار در منطقه ای از ایران تا شمال هند بوده و از زمان های قدیم در سراسر منطقه مدیترانه کشت می شده است. در اواخر قرن 16 به آمریکای اسپانیایی و در سال 1769 توسط مهاجران اسپانیایی به کالیفرنیا وارد شد.

                    این میوه معمولاً در نیمکره شمالی از سپتامبر تا فوریه و در نیمکره جنوبی از مارس تا می در فصل است. انار به عنوان سارکوتستا یا آب میوه دست نخورده در پخت، پخت و پز، مخلوط آبمیوه، چاشنی غذا، اسموتی ها و نوشیدنی های الکلی مانند کوکتل و شراب استفاده می شود.

                    شرح

                    پوسته میوه انار به رنگ قرمز مایل به ارغوانی دارای دو قسمت است: یک پوسته بیرونی سخت و یک مزوکارپ اسفنجی درونی (آلبدو) که دیواره داخلی میوه را تشکیل می دهد که در آن دانه ها می چسبند. غشاهای مزوکارپ به صورت اتاقک های نامتقارن سازماندهی شده اند که حاوی دانه هایی در داخل sarcotestas هستند که بدون اتصال به مزوکارپ تعبیه شده اند. سارکوتستا که حاوی آبمیوه است به صورت غشای نازکی که از سلول های اپیدرمی دانه ها به دست می آید تشکیل می شود. تعداد دانه های یک انار می تواند از 200 تا حدود 1400 دانه متغیر باشد.

                    از نظر گیاه شناسی، میوه خوراکی توت با دانه ها و پالپ تولید شده از تخمدان یک گل است. این میوه از نظر اندازه متوسط ​​بین لیمو و گریپ فروت، 5 تا 12 سانتی متر (2 تا 5 اینچ) قطر با شکل گرد و پوسته ضخیم و مایل به قرمز است.

                    کشت

                    گراناتوم انار برای محصول میوه آن و به عنوان درختان و درختچه های زینتی در پارک ها و باغ ها کشت می شود. نمونه‌های بالغ می‌توانند تنه‌های متعددی از پوست پیچ خورده و یک فرم کلی متمایز ایجاد کنند. انار به خشکی مقاوم است و می تواند در مناطق خشک با آب و هوای بارانی مدیترانه ای زمستانی و یا در آب و هوای بارانی تابستانی رشد کند. در مناطق مرطوب تر، آنها می توانند مستعد پوسیدگی ریشه در اثر بیماری های قارچی باشند. آنها می توانند در برابر یخبندان متوسط، تا حدود -12 درجه سانتیگراد (10 درجه فارنهایت) تحمل کنند.

                    آفات حشرات انار می توانند شامل پروانه انار Virachola isocrates و حشره پا برگ Leptoglossus zonaus باشند و مگس های میوه و مورچه ها جذب میوه های رسیده برداشت نشده می شوند. انار به راحتی از دانه رشد می کند، اما معمولاً از 25 تا 50 سانتی متر (10 تا 20 اینچ) قلمه های چوب سخت تکثیر می شود تا از تنوع ژنتیکی نهال ها جلوگیری شود. لایه بندی هوا نیز گزینه ای برای تکثیر است، اما پیوند با شکست مواجه می شود.
          """,
        nutrition: ["346 kJ (83 kcal)","13.67 g","1.17 g","1.67 g","B1, B2, B3, B5, B6, B9, C, E, K","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "گلابی",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "pear",
        gradientColors: [Color("ColorPearLight"), Color("ColorPearDark")],
        description: """
          گلابی درخت و درختچه گونه ای از تیره از خانواده Rosaceae است که میوه تفاله‌ای به همین نام دارد. چندین گونه گلابی به دلیل میوه ها و آب میوه های خوراکی ارزشمند هستند در حالی که گونه های دیگر به عنوان درخت کشت می شوند.

                    این درخت اندازه متوسط ​​و بومی مناطق ساحلی و همچنین مناطق معتدل اروپا، شمال آفریقا و آسیا است. چوب گلابی یکی از مواد ارجح در ساخت سازهای بادی چوبی و مبلمان با کیفیت بالا است.

                    حدود 3000 گونه شناخته شده گلابی در سراسر جهان رشد می کند. میوه به صورت تازه، کنسرو شده، آب میوه و خشک مصرف می شود.

                    شرح

                    گلابی بومی مناطق ساحلی و معتدل جهان قدیم، از غرب اروپا و شمال آفریقا در شرق و در سراسر آسیا است. این درختی با اندازه متوسط ​​است که ارتفاع آن به 10 تا 17 متر (33 تا 56 فوت) می رسد و اغلب دارای تاجی بلند و باریک است. چند گونه درختچه ای هستند.

                    برگها به طور متناوب چیده شده اند، ساده، 2 تا 12 سانتی متر (1-4 1⁄2 اینچ) طول، سبز براق در برخی از گونه ها، و در برخی دیگر پرمویی نقره ای. شکل برگ از بیضی پهن تا نیزه ای باریک متفاوت است. بیشتر گلابی ها برگریز هستند، اما یک یا دو گونه در جنوب شرقی آسیا همیشه سبز هستند.
                    
                    اکثر آنها به سرما مقاوم هستند و در زمستان در دمای 25- تا 40- درجه سانتیگراد (13- تا 40- درجه فارنهایت) مقاوم هستند، به جز گونه های همیشه سبز که فقط تا حدود 15- درجه سانتیگراد (5 درجه سانتیگراد) را تحمل می کنند. و)

                    کشت

                    به گفته Pear Bureau Northwest، حدود 3000 گونه شناخته شده گلابی در سرتاسر جهان رشد می کند.[9] گلابی معمولاً با پیوند یک رقم انتخاب شده روی پایه که ممکن است از نوع گلابی یا به باشد تکثیر می شود. پایه های به درختان کوچک تری تولید می کنند که اغلب در باغ های تجاری یا باغ های خانگی مطلوب است.

                    برای گونه‌های جدید، گل‌ها را می‌توان برای حفظ یا ترکیب ویژگی‌های مطلوب به صورت متقابل اصلاح کرد. میوه گلابی بر روی خارها تولید می شود که روی شاخه های بیش از یک سال ظاهر می شوند.

                    سه گونه اکثریت قریب به اتفاق تولید میوه های خوراکی را تشکیل می دهند، گلابی اروپایی Pyrus communis subsp. communis عمدتاً در اروپا و آمریکای شمالی کشت می‌شود، گلابی سفید چینی (bai li) Pyrus ×bretschneideri و گلابی Nashi Pyrus pyrifolia (همچنین به عنوان گلابی آسیایی یا گلابی سیب شناخته می‌شود) که هر دو عمدتاً در آسیای شرقی رشد می‌کنند. هزاران رقم از این سه گونه وجود دارد.

                    گونه‌ای که در غرب چین رشد می‌کند، P. sinkiangensis، و P. pashia، که در جنوب چین و جنوب آسیا رشد می‌کند، نیز به میزان کمتری تولید می‌شوند.

                    گونه های دیگر به عنوان پایه گلابی اروپایی و آسیایی و به عنوان درختان زینتی استفاده می شود. چوب گلابی دانه نزدیک است و حداقل در گذشته به عنوان الوار تخصصی برای مبلمان ظریف و ساختن بلوک برای تراش چوب استفاده می شد. گلابی منچوری یا اوسوری، Pyrus ussuriensis (که میوه‌ای نامطلوب تولید می‌کند) با Pyrus communis تلاقی داده شده است تا ارقام گلابی سخت‌تر را پرورش دهد.

                    گلابی برادفورد (Pyrus calleryana 'Bradford') به طور خاص در آمریکای شمالی گسترده شده است و تنها به عنوان یک درخت زینتی و همچنین یک پایه مقاوم در برابر سوختگی برای باغ های میوه Pyrus communis استفاده می شود. گلابی برگ بید (Pyrus salicifolia) به دلیل برگ‌های جذاب، باریک و پرمویی نقره‌ای خود رشد می‌کند.
          """,
        nutrition: ["239 kJ (57 kcal)","9.75 g","0.14 g","0.36 g","B1, B2, B3, B5, B6, B9, C, E, K","کلسیم, آّهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "انگور گوزبری",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "gooseberry",
        gradientColors: [Color("ColorGooseberryLight"), Color("ColorGooseberryDark")],
        description: """
          انگور فرنگی (انگور گوزبری)

                    بومی اروپا، قفقاز و شمال آفریقا است. این گونه همچنین در مکان های پراکنده در آمریکای شمالی به طور محدود طبیعی شده است. بوته های انگور فرنگی یک میوه خوراکی تولید می کنند و هم به صورت تجاری و هم به صورت خانگی رشد می کنند. توزیع بومی آن نامشخص است، زیرا ممکن است از کشت فرار کرده و طبیعی شده باشد. مثلاً در بریتانیا برخی منابع آن را بومی [4] و برخی دیگر مقدمه می دانند.

                    اگرچه معمولاً به‌عنوان یک زیرجنس در ریبس قرار می‌گیرد، تعداد کمی از تاکسونومیست‌ها Grossularia را به‌عنوان یک جنس جداگانه در نظر می‌گیرند، اگرچه هیبرید بین انگور فرنگی و انگور فرنگی سیاه (به عنوان مثال، جوستابری) امکان پذیر است. زیرجنس Grossularia تا حدودی با مویز تفاوت دارد، عمدتاً در ساقه‌های خاردارشان، و از این جهت که گل‌های آن‌ها یک تا سه با هم روی ساقه‌های کوتاه رشد می‌کنند، نه در شاخه‌ها. این یکی از چندین گونه مشابه در زیرجنس Grossularia است. برای سایر گونه های مرتبط (به عنوان مثال، انگور فرنگی آمریکایی شمالی Ribes hirtellum)، به صفحه جنس Ribes مراجعه کنید.

                    کشت

                    یکی از روش های تکثیر انگور فرنگی از طریق قلمه زدن به جای پرورش از بذر است. قلمه‌هایی که در پاییز کاشته می‌شوند به سرعت ریشه می‌دهند و در عرض چند سال می‌توانند میوه بدهند. آنهایی که از دانه ها رشد می کنند به سرعت بوته های سالم و پرمحصول تولید می کنند. هرس باید انجام شود تا نور وارد شود و به رشد جدید شاخه های سال آینده فرصتی برای رشد بدهد. میوه بر روی خارهای جانبی و روی شاخه های سال قبل تولید می شود.[13] هدف اصلی ورود نور است و هدف فرعی این است که امکان چیدن بدون خراش بیش از حد از خارها را فراهم کند.

                    از کمپوست کردن نیتروژن سنگین باید اجتناب شود زیرا نیتروژن بیش از حد باعث رشد گسترده و ضعیف شدن بوته می شود. این باعث می شود که بوته مستعد ابتلا به کپک باشد. بهتر است میوه را زمانی که بزرگ است برداشت کنید تا به حداکثر شیرینی برسد. سوپرمارکت‌ها معمولاً سوپرمارکت‌ها را زود و قبل از رسیدن و شیرین شدن می‌چینند تا ماندگاری طولانی داشته باشند. شاخه های پر بار باید به طور کامل با انواع توت ها قطع شوند، این واقعاً به نفع محصولات آینده است زیرا اجازه می دهد نور به رشد جدید برسد.

                    آشپزی

                    انگور فرنگی خوراکی است و می توان آن را همانطور که هست خورد یا به عنوان یک ماده در دسرهایی مانند پای، فول و کرامبل استفاده کرد. چیدن اولیه معمولاً ترش است و برای استفاده در آشپزی مناسب تر است. آنها همچنین برای طعم دادن به نوشیدنی هایی مانند نوشابه، آب طعم دار یا شیر استفاده می شوند و می توان آنها را به شراب میوه و چای تبدیل کرد. انگور فرنگی را می توان به صورت مربا، میوه خشک یا به عنوان ماده اولیه یا ثانویه ترشی نگهداری کرد یا در شربت شکر نگهداری کرد.
          """,
        nutrition: ["184 kJ (44 kcal)","6.15","0.58 g","0.88 g","A, B1, B2, B3, B5, B6, B9, C, E","کلسیم, آّهن, منیزیم, Manganese, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "انبه",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "mango",
        gradientColors: [Color("ColorMangoLight"), Color("ColorMangoDark")],
        description: """
          انبه یک میوه هسته دار آبدار (دروپه) است که از گونه های متعدد درختان استوایی متعلق به جنس گیاه گلدار Mangifera تولید می شود که بیشتر برای میوه های خوراکی آنها کشت می شود. بیشتر این گونه ها در طبیعت به صورت انبه وحشی یافت می شوند. این جنس از خانواده بادام هندی Anacardiaceae است. انبه بومی آسیای جنوبی است، جایی که "انبه معمولی" یا "انبه هندی"، Mangifera indica، در سرتاسر جهان توزیع شده است تا به یکی از میوه های کشت شده در مناطق استوایی تبدیل شود. سایر گونه های Mangifera (مانند انبه اسبی، Mangifera foetida) به صورت محلی تر رشد می کنند.

                    در سراسر جهان، صدها رقم انبه وجود دارد. بسته به رقم، میوه انبه از نظر اندازه، شکل، شیرینی، رنگ پوست و رنگ گوشت متفاوت است که ممکن است زرد کم رنگ، طلایی یا نارنجی باشد. انبه میوه ملی هند و پاکستان و درخت ملی بنگلادش است. این میوه ملی غیر رسمی فیلیپین است.

                    شرح

                    درختان انبه به ارتفاع 35 تا 40 متر (115 تا 131 فوت) با شعاع تاج 10 متر (33 فوت) رشد می کنند. درختان عمر طولانی دارند، زیرا برخی از نمونه ها پس از 300 سال هنوز میوه می دهند.[9] در خاک عمیق، ریشه ریشه تا عمق 6 متری (20 فوتی) فرود می‌آید، با ریشه‌های تغذیه‌کننده فراوان و گسترده و ریشه‌های لنگر که عمیقاً در خاک نفوذ می‌کنند.[1] برگها همیشه سبز، متناوب، ساده، 15-35 سانتی متر (5.9-13.8 اینچ) طول و 6-16 سانتی متر (2.4-6.3 اینچ) پهن هستند. هنگامی که برگها جوان هستند نارنجی مایل به صورتی هستند که به سرعت به قرمز تیره و براق تغییر می کنند و سپس با بالغ شدن به سبز تیره تبدیل می شوند. گل ها در خوشه های انتهایی به طول 10-40 سانتی متر (3.9-15.7 اینچ) تولید می شوند. هر گل کوچک و سفید با پنج گلبرگ به طول 5-10 میلی متر (0.20-0.39 اینچ)، با رایحه ملایم و شیرین است. بیش از 500 نوع انبه شناخته شده است، [1] که بسیاری از آنها در تابستان می رسند، در حالی که برخی از آنها دوبرابر محصول می دهند. از زمان گلدهی تا رسیدن میوه چهار تا پنج ماه طول می کشد.

                    کشت

                    انبه هزاران سال است که در جنوب آسیا کشت می شود و بین قرن پنجم و چهارم قبل از میلاد به آسیای جنوب شرقی رسیده است. در قرن دهم میلادی، کشت در شرق آفریقا آغاز شده بود.[12] سیاح مراکشی قرن چهاردهم ابن بطوطه در موگادیشو گزارش داد. کشت بعداً به برزیل، برمودا، هند غربی و مکزیک رسید، جایی که آب و هوای مناسب اجازه رشد آن را می‌دهد.

                    انبه در حال حاضر در اکثر مناطق گرمسیری بدون یخبندان و آب و هوای نیمه گرمسیری گرمتر کشت می شود. تقریبا نیمی از انبه های جهان تنها در هند کشت می شوند و دومین منبع بزرگ آن چین است. انبه همچنین در اندلس، اسپانیا (عمدتا در استان مالاگا) رشد می کند، زیرا آب و هوای نیمه گرمسیری ساحلی آن یکی از معدود مکان هایی در سرزمین اصلی اروپا است که امکان رشد گیاهان گرمسیری و درختان میوه را فراهم می کند. جزایر قناری یکی دیگر از تولیدکنندگان برجسته اسپانیایی این میوه است. سایر پرورش دهندگان شامل آمریکای شمالی (در فلوریدا جنوبی و دره کواچلا کالیفرنیا)، آمریکای جنوبی و مرکزی، کارائیب، هاوایی، جنوب، غرب و مرکز آفریقا، استرالیا، چین، کره جنوبی، پاکستان، بنگلادش و آسیای جنوب شرقی هستند. اگرچه هند بزرگترین تولید کننده انبه است، اما کمتر از 1% تجارت بین المللی انبه را به خود اختصاص داده است. هند بیشتر تولیدات خود را مصرف می کند.

                    آشپزی

                    صدها رقم انبه با نام وجود دارد. در باغات انبه، ارقام متعددی اغلب به منظور بهبود گرده افشانی کشت می شوند. بسیاری از ارقام مورد نظر تک جنینی هستند و باید از طریق پیوند تکثیر شوند، در غیر این صورت درست زاد و ولد نمی کنند. یک رقم متداول تک جنینی آلفونسو است که یک محصول صادراتی مهم است که به عنوان "سلطان انبه" شناخته می شود.

                    ارقامی که در یک اقلیم برتری دارند ممکن است در جای دیگر شکست بخورند. به عنوان مثال، ارقام هندی مانند جولی، یک رقم پربار در جامائیکا، برای فرار از بیماری قارچی کشنده آنتراکنوز در فلوریدا، نیاز به درمان سالانه قارچ کش دارند. انبه آسیایی به آنتراکنوز مقاوم است.

                    بازار جهانی کنونی تحت تسلط رقم "تامی اتکینز" است، نهال "هادن" که برای اولین بار در سال 1940 در جنوب فلوریدا میوه داد و در ابتدا توسط محققان فلوریدا رد شد.[22] تولیدکنندگان و واردکنندگان در سراسر جهان این رقم را به دلیل بهره وری عالی و مقاومت در برابر بیماری، ماندگاری، قابلیت حمل و نقل، اندازه و رنگ جذاب آن پذیرفته اند.[23] اگرچه رقم تامی اتکینز از نظر تجاری موفق است، ممکن است ارقام دیگری مانند آلفونسو توسط مصرف کنندگان برای لذت خوردن ترجیح داده شوند.

                    به طور کلی، انبه رسیده دارای پوست نارنجی مایل به زرد یا قرمز است و برای خوردن آبدار است، در حالی که میوه های صادراتی اغلب در حالی که نارس با پوست سبز هستند چیده می شوند. اگرچه انبه‌های صادراتی نرسیده هنگام رسیدن، اتیلن تولید می‌کنند، آبدار بودن یا طعمی مشابه میوه‌های تازه ندارند.
          """,
        nutrition: ["250 kJ (60 kcal)","13.7 g","0.38 g","0.82 g","A, B1, B2, B3, B5, B6, B9, C, E, K","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "هندوانه",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "watermelon",
        gradientColors: [Color("ColorWatermelonLight"), Color("ColorWatermelonDark")],
        description: """
          هندوانه (Citrullus lanatus) یک گونه گیاهی از خانواده Cucurbitaceae است، گیاهی گلدار شبیه تاک که در اصل در غرب آفریقا اهلی شده است. این میوه با بیش از 1000 نوع میوه در سراسر جهان بسیار کشت شده است.

                    هندوانه نوعی انگور درهم و دنباله دار از خانواده گیاهان گلدار Cucurbitaceae است. شواهدی از دانه های موجود در مقبره فرعون برای کشت هندوانه در مصر باستان وجود دارد. هندوانه در آب و هوای مساعد از مناطق گرمسیری تا معتدل در سراسر جهان به دلیل میوه خوراکی بزرگش که نوعی توت با پوست سفت و بدون تقسیمات داخلی است رشد می‌کند و از نظر گیاه‌شناسی به آن پپو می‌گویند.

                    گوشت شیرین و آبدار آن معمولاً قرمز تیره تا صورتی است و دانه های سیاه زیادی دارد، اگرچه انواع بدون دانه آن وجود دارد. میوه را می توان به صورت خام یا ترشی مصرف کرد و پوست آن پس از پخت خوراکی است. معمولاً به عنوان آب میوه یا به عنوان یک عنصر در نوشیدنی های مخلوط مصرف می شود.

                    شرح

                    هندوانه یک ساله است که عادت به سجده یا کوهنوردی دارد. ساقه ها تا 3 متر (10 فوت) طول دارند و رشد جدید دارای کرک های زرد یا قهوه ای است. طول برگ ها 60 تا 200 میلی متر (2 1⁄4 تا 7 3⁄4 اینچ) و عرض آن 40 تا 150 میلی متر (1/2 تا 6 اینچ) است. اینها معمولاً دارای سه لوب هستند که خود لوب یا دو لوب هستند. گیاهان دارای گل های نر و ماده روی ساقه های کرک دار به طول 40 میلی متر (1 1/2 اینچ) هستند. اینها زرد و در پشت مایل به سبز هستند.

                    هندوانه گیاهی یکساله بزرگ با ساقه های بلند، ضعیف، دنباله دار یا بالارونده است که پنج گوشه (پنج طرفه) و تا 3 متر (10 فوت) طول دارد. رشد جوان بسیار پشمی با کرک های قهوه ای مایل به زرد است که با افزایش سن گیاه از بین می روند. برگها بزرگ، درشت، کرکدار و دارای لوبهای پینه ای و متناوب هستند. وقتی پیر می شوند سفت و خشن می شوند. این گیاه دارای شاخه های منشعب است.

                    گل‌های سفید تا زرد به‌تنهایی در زیر برگ‌ها رشد می‌کنند و گل تاج در داخل سفید یا زرد و از بیرون به رنگ زرد متمایل به سبز است. گل‌ها تک‌جنسی هستند و گل‌های نر و ماده روی یک گیاه می‌روند (تک‌جنسی). گلهای نر در ابتدای فصل غالب می شوند. گل های ماده که دیرتر رشد می کنند، تخمدان های پایینی دارند. سبک ها در یک ستون واحد متحد می شوند. میوه بزرگ نوعی توت اصلاح شده به نام پپو با پوست ضخیم (exocarp) و مرکز گوشتی (mesocarp و endocarp) است.

                    گیاهان وحشی میوه هایی به قطر 20 سانتی متر (8 اینچ) دارند، در حالی که گونه های کشت شده ممکن است بیش از 60 سانتی متر (24 اینچ) باشد. پوست میوه به رنگ سبز تیره تا متوسط ​​و معمولاً خالدار یا راه راه است و گوشت آن حاوی هسته های متعددی است که در داخل آن پخش شده است، می تواند قرمز یا صورتی (معمولاً)، نارنجی، زرد، سبز یا سفید باشد.

                    آشپزی

                    هندوانه گیاهانی هستند که در آب و هوای گرمسیری تا معتدل رشد می کنند و برای رشد به دمای بالاتر از حدود 25 درجه سانتیگراد (77 درجه فارنهایت) نیاز دارند. در مقیاس باغی، بذرها را معمولاً در گلدان های زیر پوشش می کارند و به خاک لومی شنی با زهکشی خوب با pH بین 5.5 تا 7 و سطوح متوسط ​​نیتروژن پیوند می زنند.

                    آفات عمده هندوانه شامل شته ها، مگس میوه و نماتدهای ریشه گره می باشد. در شرایط رطوبت بالا، گیاهان مستعد ابتلا به بیماری های گیاهی مانند سفیدک پودری و ویروس موزاییک هستند.[22] برخی از گونه هایی که اغلب در ژاپن و سایر مناطق خاور دور رشد می کنند، مستعد پژمردگی فوزاریوم هستند. پیوند چنین واریته‌هایی روی پایه‌های مقاوم به بیماری محافظت می‌کند.

                    وزارت کشاورزی ایالات متحده استفاده از حداقل یک کندوی زنبور عسل در هر هکتار (4000 متر مربع در هر کندو) را برای گرده افشانی گونه های معمولی و دانه دار برای کاشت های تجاری توصیه می کند. هیبریدهای بدون دانه گرده عقیم دارند. این مستلزم کاشت ردیف های گرده افشان از واریته ها با گرده زنده است. از آنجایی که عرضه گرده های زنده کاهش می یابد و گرده افشانی در تولید واریته بدون دانه بسیار حیاتی است، تعداد کندوهای توصیه شده در هکتار (تراکم گرده افشان) به سه کندو در هکتار (1300 متر مربع در هر کندو) افزایش می یابد. هندوانه نسبت به سایر خربزه ها دوره رشد طولانی تری دارد و اغلب از زمان پیوند 85 روز یا بیشتر طول می کشد تا میوه بالغ شود.

                    گمان می‌رود که کمبود گرده به "قلب توخالی" کمک می‌کند که باعث می‌شود گوشت هندوانه سوراخ بزرگی را ایجاد کند، گاهی اوقات به شکل پیچیده و متقارن. هندوانه هایی که از قلب توخالی رنج می برند برای مصرف بی خطر هستند.
          """,
        nutrition: ["127 kJ (30 kcal)","6.2 g","0.15 g","0.61 g","A, B1, B2, B3, B5, B6, C","کلسیم, آهن, منیزیم, منگنز, Phosphorus, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "گیلاس",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "cherry",
        gradientColors: [Color("ColorCherryLight"), Color("ColorCherryDark")],
        description: """
          گیلاس میوه بسیاری از گیاهان از جنس Prunus است و میوه ای گوشتی (میوه هسته دار) است. گیلاس های تجاری از ارقام چند گونه مانند Prunus avium شیرین و Prunus cerasus ترش به دست می آیند.

                    نام "گیلاس" همچنین به درخت گیلاس و چوب آن اشاره دارد و گاهی اوقات به درختان گلدار بادام و از نظر ظاهری مشابه در جنس Prunus مانند "گیلاس زینتی" یا "شکوفه گیلاس" اطلاق می شود. گیلاس وحشی ممکن است به هر یک از گونه های گیلاس که در خارج از کشت رشد می کنند اشاره کند، اگرچه Prunus avium اغلب به طور خاص با نام "گیلاس وحشی" در جزایر بریتانیا شناخته می شود.

                    آشپزی

                    اشکال کشت شده از گونه گیلاس شیرین (P. avium) است که بیشتر ارقام گیلاس به آن تعلق دارد و آلبالو (P. cerasus) که عمدتاً برای پخت و پز استفاده می شود. هر دو گونه در اروپا و غرب آسیا منشا می گیرند. آنها معمولا گرده افشانی متقابل ندارند. برخی از گونه های دیگر، اگرچه میوه های خوراکی دارند، اما به طور گسترده برای مصرف کشت نمی شوند، مگر در مناطق شمالی که دو گونه اصلی رشد نخواهند کرد.

                    آبیاری، سمپاشی، کارگری و آسیب دیدن آنها در اثر باران و تگرگ، گیلاس را نسبتاً گران می کند. با این حال، تقاضا برای میوه بالا است. در تولیدات تجاری، آلبالو و گاهی گیلاس شیرین با استفاده از شیکر مکانیزه برداشت می شود.[8] چیدن دستی همچنین به طور گسترده ای برای گیلاس شیرین و همچنین برای برداشت میوه استفاده می شود تا از آسیب به میوه ها و درختان جلوگیری شود.

                    پایه های رایج شامل مازارد، محلب، کلت، و سری Gisela، یک پایه کوتوله است که درختانی به طور قابل توجهی کوچکتر از سایرین تولید می کند، تنها 8 تا 10 فوت (2.5 تا 3 متر) ارتفاع دارند.[9] آلبالو نیازی به گرده افشان ندارد، در حالی که تعداد کمی از انواع شیرین خود بارور هستند.

                    زمانی که درخت گیلاس برای تولید اولین محصول خود در باغ کاشته شود، سه تا چهار سال طول می‌کشد و برای رسیدن به بلوغ کامل، هفت سال طول می‌کشد.
          """,
        nutrition: ["209 kJ (50 kcal)","8.5 g","0.3 g","1 g","A, B1, B2, B3, B5, B6, B9, C, K","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      ),
      Fruit(
        title: "گریپ فروت",
        headline: "میوه های شیرین و زنگوله ای شکل که از زمان های قدیم مورد استفاده قرار می گرفته است. آنها را می توان به صورت ترد یا نرم مصرف کرد.",
        image: "grapefruit",
        gradientColors: [Color("ColorGrapefruitLight"), Color("ColorGrapefruitDark")],
        description: """
          گریپ فروت (Citrus × paradisi) یک درخت مرکبات نیمه گرمسیری است که به دلیل میوه نسبتاً بزرگ ترش تا نیمه شیرین و تا حدودی تلخش شناخته شده است. گریپ فروت ترکیبی از مرکبات است که در باربادوس به عنوان تلاقی تصادفی بین پرتقال شیرین (C. sinensis) و پوملو (یا shaddock؛ C. maxima)، که هر دو از آسیا در قرن هفدهم معرفی شدند، منشا گرفته است.[2] وقتی پیدا شد، به آن لقب "میوه ممنوعه" داده شد. اغلب، به اشتباه به عنوان گونه والد بسیار مشابه، پوملو، شناسایی می شود.

                    قسمت "انگور" نام اشاره به خوشه های میوه روی درخت دارد که اغلب شبیه به خوشه های انگور است. گوشت داخلی قطعه قطعه است و رنگ آن از سفید تا زرد تا صورتی تا قرمز متغیر است.

                    شرح

                    درختان گریپ فروت همیشه سبز معمولاً به 5-6 متر (16-20 فوت) بلند می شوند، اگرچه ممکن است به 13-15 متر (43-49 فوت) برسند. برگ ها براق، سبز تیره، بلند (تا 15 سانتی متر (5.9 اینچ)) و نازک هستند. گلهای چهار گلبرگ سفید 5 سانتی متری (2 اینچی) تولید می کند. میوه با پوست زرد مایل به نارنجی و به طور کلی کروی شکل است. قطر آن از 10 تا 15 سانتی متر (3.9 تا 5.9 اینچ) متغیر است. گوشت قطعه قطعه و اسیدی است و بسته به ارقام رنگ آن متفاوت است که شامل پالپ های سفید، صورتی و قرمز با شیرینی های مختلف است (به طور کلی، گونه های قرمزتر شیرین ترین هستند). 1929 U.S. Ruby Red (از گونه "Redblush") اولین اختراع گریپ فروت را دارد.

                    آشپزی

                    انواع گریپ فروت با رنگ گوشت میوه ای که تولید می کنند متمایز می شوند. انواع متداول آن رنگ های خمیری قرمز، سفید و صورتی است. طعم ها از بسیار اسیدی و تا حدودی ترش تا شیرین و ترش متغیر است که از ترکیب قندها (عمدتا ساکارز)، اسیدهای آلی (عمدتا اسید سیتریک) و مونوترپن ها و سسکوی ترپن ها ایجاد می شود.

                    گریپ فروت مرکاپتان، یک ترپن حاوی گوگرد، یکی از ترکیبات معطر موثر بر طعم و بوی گریپ فروت در مقایسه با سایر مرکبات است.

                    گریپ فروت خام 90٪ آب، 8٪ کربوهیدرات، 1٪ پروتئین و چربی ناچیز (جدول) است. در یک مقدار مرجع 100 گرم، گریپ فروت خام 33 کالری دارد و منبعی غنی از ویتامین C (40 درصد ارزش روزانه) است و هیچ ریز مغذی دیگری در محتوای قابل توجهی ندارد.

                    در کاستاریکا، به ویژه در آتناس، گریپ فروت اغلب برای از بین بردن ترشی آن پخته می شود و به عنوان شیرینی تبدیل می شود. آنها همچنین با dulce de leche پر می شوند و در نتیجه دسری به نام toronja rellena (گریپ فروت پر شده) ایجاد می شود. در هائیتی، گریپ فروت عمدتاً برای آب آن (jus de Chadèque) استفاده می شود، اما همچنین برای تهیه مربا (confiture de Chadèque) استفاده می شود.
          """,
        nutrition: ["138 kJ (33 kcal)","7.31 g","0.10 g","0.8 g","B1, B2, B3, B5, B6, B9, C, E","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, روی"]
      ),
      Fruit(
        title: "سیب",
        headline: "سیب یکی از محبوب ترین و فوق العاده سالم ترین میوه ها به دلایل خوب است.",
        image: "apple",
        gradientColors: [Color("ColorAppleLight"), Color("ColorAppleDark")],
        description: """
          سیب میوه ای خوراکی است که توسط درخت سیب (Malus domestica) تولید می شود. درختان سیب در سرتاسر جهان کشت می‌شوند و بیشترین رشد را در جنس Malus دارند. منشا این درخت آسیای مرکزی است، جایی که جد وحشی آن، Malus sieversii، هنوز در آن یافت می شود. سیب هزاران سال است که در آسیا و اروپا رشد می کند و توسط استعمارگران اروپایی به آمریکای شمالی آورده شده است. سیب در بسیاری از فرهنگ ها، از جمله سنت مسیحی اسکاندیناوی، یونانی و اروپایی اهمیت مذهبی و اساطیری دارد.

                    شرح

                    سیب درختی برگریز است که معمولاً در کشت 2 تا 4.5 متر (6 تا 15 فوت) و در طبیعت تا 9 متر (30 فوت) ارتفاع دارد. هنگام کشت، اندازه، شکل و تراکم شاخه ها با انتخاب پایه و روش پیرایش تعیین می شود. برگها به صورت متناوب بیضی ساده به رنگ سبز تیره با حاشیه دندانه دار و سطح زیرین کمی پرزدار قرار گرفته اند.

                    شکوفه ها در بهار همزمان با جوانه زدن برگ ها تولید می شوند و روی خارها و برخی از شاخه های بلند تولید می شوند. گل‌های 3 تا 4 سانتی‌متری (1 تا 1 1⁄2 اینچ) سفید با رنگ صورتی است که به تدریج محو می‌شود، پنج گلبرگ، با گل آذین متشکل از سینه‌ای با 4 تا 6 گل. گل مرکزی گل آذین "شکوفه شاه" نامیده می شود. ابتدا باز می شود و می تواند میوه بزرگتری ایجاد کند.

                    کشت

                    بیش از 7500 رقم شناخته شده سیب وجود دارد.[44] ارقام از نظر عملکرد و اندازه نهایی درخت، حتی زمانی که روی یک پایه رشد می کنند، متفاوت است.[45] ارقام مختلف برای آب و هوای معتدل و نیمه گرمسیری موجود است. مجموعه ملی میوه بریتانیا که مسئولیت آن بر عهده وزارت محیط زیست، غذا و امور روستایی است، شامل مجموعه ای از بیش از 2000 رقم درخت سیب در کنت است.

                    پایگاه داده ملی مجموعه میوه های بریتانیا حاوی اطلاعات زیادی در مورد ویژگی ها و منشاء بسیاری از سیب ها، از جمله نام های جایگزین برای چیزی است که اساساً همان رقم سیب "ژنتیکی" است. بیشتر این ارقام برای خوردن تازه (سیب دسر) پرورش داده می شوند، اگرچه برخی به طور خاص برای پخت و پز (آشپزی سیب) یا تولید سیب زمینی کشت می شوند. سیب‌های سیب معمولاً برای خوردن تازه خیلی ترش و قابض هستند، اما طعمی غنی به نوشیدنی می‌دهند که سیب‌های دسر نمی‌توانند.

                    ارقام تجاری محبوب سیب نرم اما ترد هستند. سایر ویژگی های مطلوب در پرورش سیب تجاری مدرن پوست رنگارنگ، عدم زنگ زدگی، سهولت حمل و نقل، قابلیت نگهداری طولانی مدت، محصول بالا، مقاومت در برابر بیماری، شکل رایج سیب و طعم توسعه یافته است. سیب های مدرن به طور کلی شیرین تر از ارقام قدیمی هستند، زیرا طعم های رایج در سیب در طول زمان متفاوت بوده است. اکثر مردم آمریکای شمالی و اروپایی ها به سیب های شیرین و غیر اسیدی علاقه دارند، اما سیب های ترش طرفداران زیادی دارند. سیب های بسیار شیرین با هیچ طعم اسیدی در آسیا، به ویژه شبه قاره هند، محبوب هستند.
          """,
        nutrition: ["218 kJ (52 kcal)","10.39 g","0.17 g","0.26 g","A, B1, B2, B3, B5, B6, B9, C, E, K","کلسیم, آهن, منیزیم, منگنز, فسفر, پتاسیم, سدیم, روی"]
      )
]
